app/services/purchase_item_service.rb

UPDATE "products" SET "stock" = 0, "updated_at" = '2026-03-10 10:24:32.514389' WHERE "products"."id" = 1
---
  def decrement_stock
      product.decrement(:stock)
      product.save!

SELECT "coins".* FROM "coins" WHERE "coins"."denomination" = 50 LIMIT 1
UPDATE "coins" SET "stock" = 4, "updated_at" = '2026-03-10 10:24:32.555801' WHERE "coins"."id" = 6
---
  def decrement_coins
    @coins_to_decrement.each do |denomination, decrement|
      coin = Coin.find_by(denomination:)
      coin.update!(stock: coin.stock - decrement)

SELECT "coins"."denomination" FROM "coins" WHERE (stock > 0) ORDER BY "coins"."denomination" DESC
SELECT "coins"."stock" FROM "coins" WHERE (stock > 0) ORDER BY "coins"."denomination" DESC
---
  def fetch_available_coins
    valid_coins = Coin.select(:denomination, :stock).where('stock > 0').order(denomination: :DESC)
    @coins = valid_coins.pluck(:denomination)
    @stocks = valid_coins.pluck(:stock)