app/controllers/coins_controller.rb

  def refill
    success = Coin.transaction do
      Coin.update_all(stock: VENDING_MACHINE_MAX_COIN_STOCK)
    end

    if success
      render json: {
        message: 'All coins refilled',
        updated_count: Coin.count
---
UPDATE "coins" SET "stock" = $1  [["stock", 100]]
SELECT COUNT(*) FROM "coins"