app/controllers/products_controller.rb

  def index
    page = (params[:page] || 1).to_i
    per_page = 50
    offset = (page - 1) * per_page

    products = Product
      .select(:id, :name, :price, :stock)
      .order(:name)
      .limit(per_page)
      .offset(offset)

    total_count = Product.count
---
SELECT COUNT(*) FROM "products"

  def create
    product = Product.new(product_params)

    if product.save
---
INSERT INTO "products" ("name", "stock", "price", "created_at", "updated_at") VALUES ('Fanta', 5, 1.65, '2026-03-10 10:12:07.771331', '2026-03-10 10:12:07.771331') RETURNING "id"

  def update
    if @product.update(product_params)
---
UPDATE "products" SET "name" = 'Fanta Ananas', "stock" = 10, "price" = 1.85, "updated_at" = '2026-03-10 10:14:35.016003' WHERE "products"."id" = 9

  def refill
    success = Product.transaction do
      Product.update_all(stock: VENDING_MACHINE_MAX_STOCK)
    end

    if success
      render json: {
        message: 'All products refilled',
        updated_count: Product.count
---
UPDATE "products" SET "stock" = 10
SELECT COUNT(*) FROM "products"